app/controllers/diary_entries_controller.rb

  def index
    #@diary_entries = DiaryEntry.all
    @diary_entries = DiaryEntry.all
---
SELECT "diary_entries".* FROM "diary_entries"