app/controllers/diary_entry_controller.rb

SELECT "diary_entries".* FROM "diary_entries"
---
  def index
    #@diary_entries = DiaryEntry.all
    @diary_entries = DiaryEntry.all

SELECT "diary_entries".* FROM "diary_entries"
---
  def show
    #@diary_entries = DiaryEntry.all
    @diary_entries = DiaryEntry.all